export const covenantText = 'При оформлении заказа учтите, что любые дополнительные расходы, такие как платные парковки или платные дороги, оплачиваются клиентом отдельно. Эти расходы не включены в стоимость услуги и будут рассчитаны дополнительно.'

export const withTrailerText = 'Грузы до 750 кг'
export const isImmediateText = 'Водитель прибудёт в течении часа'

export const expressInfoText = 'Экспресс-доставка: два водителя работают посменно, один отдыхает, пока другой за рулем. Это сокращает время в пути, обеспечивая быструю и безопасную доставку.'